<!DOCTYPE html>
<html lang="es">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="theme-color" content="#0a0514">
    <link rel="icon" href="/favicon.svg" type="image/svg+xml">
    <link rel="icon" href="/favicon.ico" type="image/x-icon" sizes="64x64 48x48 32x32 16x16">
    <link rel="icon" href="/favicon.png" type="image/png" sizes="192x192">
    <link rel="apple-touch-icon" href="/logo192.png" sizes="192x192">
    <title>Pol&iacute;tica de privacidad | Noctalia</title>
    <meta name="description" content="Pol&iacute;tica de privacidad de Noctalia: datos recopilados, finalidades, alojamiento, proveedores de IA, retenci&oacute;n, seguridad y tus derechos RGPD.">
    <link rel="canonical" href="https://noctalia.app/es/politica-privacidad">
    <link rel="alternate" hreflang="en" href="https://noctalia.app/en/privacy-policy">
    <link rel="alternate" hreflang="fr" href="https://noctalia.app/fr/politique-confidentialite">
    <link rel="alternate" hreflang="es" href="https://noctalia.app/es/politica-privacidad">
    <link rel="alternate" hreflang="x-default" href="https://noctalia.app/en/privacy-policy">
    <meta property="og:locale" content="es_ES">
    <!-- Preload critical fonts -->
    <link rel="preload" href="/fonts/Outfit-Regular.woff2" as="font" type="font/woff2" crossorigin>
    <link rel="preload" href="/fonts/Outfit-Bold.woff2" as="font" type="font/woff2" crossorigin>
    <link rel="preload" href="/fonts/Fraunces-Variable.woff2" as="font" type="font/woff2" crossorigin>
    <!-- Compiled Tailwind CSS -->
    <link rel="stylesheet" href="/css/styles.min.css?v=20260108-1734">
    <link rel="stylesheet" href="/css/language-dropdown.css?v=20260108-1734">
    <!-- Lucide Icons (deferred) -->
    <script src="/js/lucide.min.js?v=20260108-1734" defer></script>
</head>
<body class="bg-dream-dark text-white font-sans antialiased selection:bg-dream-salmon selection:text-dream-dark">
    <nav class="fixed w-full z-50 top-0 left-0 px-6 py-4 bg-dream-dark/80 backdrop-blur-md border-b border-white/5">
        <div class="max-w-4xl mx-auto flex justify-between items-center">
            <a href="/es/" class="flex items-center gap-2">
                <i data-lucide="moon" class="w-6 h-6 text-dream-salmon"></i>
                <span class="font-serif text-xl font-semibold text-dream-cream">Noctalia</span>
            </a>
            <div class="flex items-center gap-3">
                <div class="language-dropdown-wrapper relative" id="languageDropdown">
                <button type="button"
                        class="text-sm text-gray-400 hover:text-white transition-colors flex items-center gap-2"
                        aria-haspopup="true"
                        aria-expanded="false"
                        aria-label="Choose language"
                        id="languageDropdownButton">
                    <i data-lucide="languages" class="w-4 h-4"></i>
                    <span class="hidden sm:inline">ES</span>
                    <i data-lucide="chevron-down" class="w-3 h-3 transition-transform" id="dropdownChevron"></i>
                </button>
                <div class="language-dropdown-menu absolute right-0 top-full mt-2 glass-panel rounded-2xl py-2 min-w-[160px] hidden z-50"
                     role="menu" aria-labelledby="languageDropdownButton" id="languageDropdownMenu">
                    <a href="../en/privacy-policy" hreflang="en"
                       class="dropdown-item flex items-center justify-between px-4 py-2 text-sm text-gray-400 hover:text-white transition-colors"
                       role="menuitem">
                        <span>English</span>
                        <i data-lucide="check" class="w-4 h-4 text-dream-salmon hidden"></i>
                    </a>
                    <a href="../fr/politique-confidentialite" hreflang="fr"
                       class="dropdown-item flex items-center justify-between px-4 py-2 text-sm text-gray-400 hover:text-white transition-colors"
                       role="menuitem">
                        <span>Français</span>
                        <i data-lucide="check" class="w-4 h-4 text-dream-salmon hidden"></i>
                    </a>
                    <a href="../es/politica-privacidad" hreflang="es"
                       class="dropdown-item flex items-center justify-between px-4 py-2 text-sm text-gray-400 hover:text-white transition-colors"
                       role="menuitem">
                        <span>Español</span>
                        <i data-lucide="check" class="w-4 h-4 text-dream-salmon"></i>
                    </a>
                </div>
            </div>
                
                <a href="/es/" class="text-sm text-gray-400 hover:text-white transition-colors flex items-center gap-2">
                    <i data-lucide="arrow-left" class="w-4 h-4"></i> Volver
                </a>
            </div>
        </div>
    </nav>

    <main class="pt-32 pb-20 px-6 max-w-5xl mx-auto">
        <h1 class="font-serif text-4xl md:text-5xl mb-6 text-dream-cream">Pol&iacute;tica de privacidad</h1>
        <p class="text-lg text-purple-200/80 mb-10">&Uacute;ltima actualizaci&oacute;n: 22 de noviembre de 2025</p>

        <div class="space-y-8 text-gray-300 leading-relaxed">
            <div class="p-6 rounded-2xl bg-dream-salmon/5 border border-dream-salmon/20">
                <p class="text-dream-salmon font-medium flex gap-2 items-start">
                    <i data-lucide="shield-check" class="w-5 h-5 mt-0.5 shrink-0"></i>
                    En resumen: Tus sue&ntilde;os te pertenecen. Nunca vendemos tus datos y no mostramos publicidad dirigida. Las grabaciones de audio se utilizan &uacute;nicamente para transcribir tu sue&ntilde;o y Noctalia no las conserva. Tus transcripciones y an&aacute;lisis se almacenan de forma segura en la Uni&oacute;n Europea.
                </p>
            </div>

            <section>
                <h2 class="text-2xl font-serif text-white mb-4 mt-8">1. &iquest;Qui&eacute;n es responsable de tus datos?</h2>
                <p>Noctalia es publicada por <strong>TiMax</strong>. TiMax act&uacute;a como <strong>Responsable del tratamiento</strong> en el sentido del RGPD para los tratamientos descritos en esta pol&iacute;tica.</p>
                <p class="mt-4">Para cualquier consulta sobre tus datos personales o para ejercer tus derechos, puedes contactarnos en: <a href="mailto:contact@noctalia.app" class="text-dream-salmon hover:underline">contact@noctalia.app</a>.</p>
            </section>

            <section>
                <h2 class="text-2xl font-serif text-white mb-4 mt-8">2. Datos que recopilamos</h2>
                <p>Al utilizar la aplicaci&oacute;n Noctalia, podemos tratar las siguientes categor&iacute;as de datos:</p>
                <ul class="list-disc pl-5 mt-4 space-y-2">
                    <li><strong>Datos de cuenta:</strong> direcci&oacute;n de email, contrase&ntilde;a (almacenada en forma hash), preferencias de idioma o visualizaci&oacute;n, informaci&oacute;n relacionada con la creaci&oacute;n y gesti&oacute;n de tu cuenta.</li>
                    <li><strong>Datos de sue&ntilde;os:</strong> transcripciones textuales de tus sue&ntilde;os, an&aacute;lisis generados por IA, citas compartibles, temas o categor&iacute;as, tipo de sue&ntilde;o, estado de favorito, as&iacute; como las im&aacute;genes generadas para ilustrar tus sue&ntilde;os y el historial de conversaciones con el asistente de IA sobre tus sue&ntilde;os.</li>
                    <li><strong>Grabaciones de audio:</strong> cuando utilizas la funci&oacute;n de grabaci&oacute;n de voz, tu voz se procesa para producir una transcripci&oacute;n. Noctalia no graba ni almacena tus archivos de audio en sus servidores: se procesan en tiempo real &uacute;nicamente para producir la transcripci&oacute;n y luego se eliminan del flujo t&eacute;cnico. Solo el texto transcrito se guarda en tu diario.</li>
                    <li><strong>Datos t&eacute;cnicos y de uso:</strong> registros t&eacute;cnicos (errores, rendimiento, eventos de seguridad), informaci&oacute;n b&aacute;sica del dispositivo (sistema operativo, versi&oacute;n de la app), un identificador de dispositivo hasheado utilizado &uacute;nicamente para la gesti&oacute;n de cuotas de uso gratuito, identificadores t&eacute;cnicos necesarios para proporcionar el servicio. Actualmente no utilizamos <strong>ninguna herramienta de anal&iacute;tica de marketing de terceros</strong> (como Google Analytics, Mixpanel, etc.).</li>
                    <li><strong>Datos de soporte:</strong> contenido de tus comunicaciones con nosotros (por ejemplo, cuando nos contactas por email) e informaci&oacute;n necesaria para el seguimiento de tus solicitudes.</li>
                </ul>
                <p class="mt-4">El contenido que grabas en Noctalia puede, seg&uacute;n tu elecci&oacute;n, contener informaci&oacute;n sensible en el sentido del RGPD (por ejemplo, elementos relacionados con tu salud, vida sexual, creencias, etc.). Esta informaci&oacute;n se procesa &uacute;nicamente para proporcionarte el servicio de diario y an&aacute;lisis de sue&ntilde;os, bas&aacute;ndose en tu <strong>consentimiento expl&iacute;cito</strong> y tu iniciativa al grabarla.</p>
            </section>

            <section>
                <h2 class="text-2xl font-serif text-white mb-4 mt-8">3. Finalidades y bases legales</h2>
                <p>Tratamos tus datos personales para las siguientes finalidades y bases legales:</p>
                <ul class="list-disc pl-5 mt-4 space-y-2">
                    <li><strong>Proporcionar la aplicaci&oacute;n y sus funcionalidades</strong> (diario de sue&ntilde;os, an&aacute;lisis, im&aacute;genes generadas, creaci&oacute;n y gesti&oacute;n de cuenta): tratamiento necesario para la <strong>ejecuci&oacute;n del contrato</strong> (aceptaci&oacute;n de los T&eacute;rminos de Servicio) entre t&uacute; y Noctalia.</li>
                    <li><strong>Transcripci&oacute;n y an&aacute;lisis de tus sue&ntilde;os, incluso cuando contienen informaci&oacute;n sensible:</strong> tratamiento basado en tu <strong>consentimiento expl&iacute;cito</strong>, que puedes retirar en cualquier momento eliminando los sue&ntilde;os relevantes y/o tu cuenta.</li>
                    <li><strong>Mejora de la aplicaci&oacute;n, medici&oacute;n de estabilidad, prevenci&oacute;n de abusos y seguridad:</strong> tratamiento basado en nuestro <strong>inter&eacute;s leg&iacute;timo</strong> en asegurar el correcto funcionamiento, seguridad y desarrollo del servicio, sin perfilado de marketing.</li>
                    <li><strong>Gesti&oacute;n de solicitudes de ejercicio de derechos, soporte al usuario y cumplimiento legal:</strong> tratamiento necesario para cumplir con nuestras <strong>obligaciones legales</strong> y para <strong>ejercer nuestros derechos</strong> (evidencia, defensa legal, etc.).</li>
                </ul>
            </section>

            <section>
                <h2 class="text-2xl font-serif text-white mb-4 mt-8">4. Uso de Inteligencia Artificial y voz</h2>
                <p>Noctalia se apoya en servicios de Inteligencia Artificial para transcribir y analizar tus sue&ntilde;os, as&iacute; como para generar im&aacute;genes asociadas.</p>
                <ul class="list-disc pl-5 mt-4 space-y-2">
                    <li><strong>Reconocimiento de voz:</strong> utilizamos principalmente el reconocimiento de voz nativo de tu dispositivo (a trav&eacute;s de interfaces del sistema). En caso de fallo o indisponibilidad, una grabaci&oacute;n de audio puede transmitirse temporalmente a un servicio de reconocimiento de voz de terceros (por ejemplo, Google Cloud Speech-to-Text) a trav&eacute;s de nuestro backend para producir una transcripci&oacute;n. Estas grabaciones de audio se procesan en tiempo real para producir la transcripci&oacute;n y Noctalia no las almacena de forma persistente.</li>
                    <li><strong>An&aacute;lisis de sue&ntilde;os y generaci&oacute;n de contenido:</strong> el texto de tus sue&ntilde;os y ciertos metadatos estrictamente necesarios se env&iacute;an a nuestro proveedor principal de IA, actualmente <strong>Google (Gemini)</strong>, para generar an&aacute;lisis, res&uacute;menes, elementos de conversaci&oacute;n y visuales.</li>
                    <li><strong>Otros proveedores de IA l&iacute;deres:</strong> en el futuro, podemos utilizar otros proveedores de IA de alto nivel como <strong>Anthropic, OpenAI, Perplexity, Mistral</strong>, o servicios equivalentes. Solo los activaremos si disponemos de garant&iacute;as contractuales y t&eacute;cnicas equivalentes (seguridad, confidencialidad, limitaciones de uso).</li>
                    <li><strong>Entrenamiento de modelos:</strong> donde estos servicios lo permiten, configuramos a nuestros proveedores de IA para que <strong>no utilicen tus datos para entrenar sus modelos generales</strong>. Cuando corresponda, tus datos solo se utilizan para proporcionar el servicio solicitado (transcripci&oacute;n, an&aacute;lisis, generaci&oacute;n de imagen o texto).</li>
                </ul>
            </section>

            <section>
                <h2 class="text-2xl font-serif text-white mb-4 mt-8">5. Almacenamiento, seguridad y ubicaci&oacute;n de datos</h2>
                <p>La seguridad y ubicaci&oacute;n de tus datos son el n&uacute;cleo de nuestro enfoque.</p>
                <ul class="list-disc pl-5 mt-4 space-y-2">
                    <li><strong>Cifrado de comunicaciones:</strong> los intercambios entre tu dispositivo y nuestros servidores est&aacute;n protegidos por protocolos de cifrado SSL/TLS.</li>
                    <li><strong>Base de datos en la Uni&oacute;n Europea:</strong> tus datos de cuenta y sue&ntilde;os se alojan en una base de datos <strong>Supabase</strong> ubicada en <strong>Europa Occidental (UE)</strong>, en servidores seguros sujetos al RGPD.</li>
                    <li><strong>Acceso limitado:</strong> el acceso a tus datos est&aacute; estrictamente limitado a las personas y proveedores de servicios que lo necesitan para proporcionar el servicio (seg&uacute;n necesidad de conocer). T&uacute; conservas el control sobre tu diario de sue&ntilde;os a trav&eacute;s de tu cuenta.</li>
                    <li><strong>Transferencias internacionales controladas:</strong> algunos de nuestros proveedores de servicios (principalmente proveedores de IA) pueden estar ubicados fuera del Espacio Econ&oacute;mico Europeo (por ejemplo, en Estados Unidos). En este caso, implementamos <strong>garant&iacute;as adecuadas</strong> como las <strong>Cl&aacute;usulas Contractuales Tipo</strong> de la Comisi&oacute;n Europea y, cuando corresponda, la adhesi&oacute;n al <strong>Data Privacy Framework</strong> o mecanismos equivalentes.</li>
                </ul>
            </section>

            <section>
                <h2 class="text-2xl font-serif text-white mb-4 mt-8">6. Per&iacute;odos de retenci&oacute;n</h2>
                <p>Conservamos tus datos personales durante un per&iacute;odo limitado, proporcional a las finalidades perseguidas:</p>
                <ul class="list-disc pl-5 mt-4 space-y-2">
                    <li><strong>Cuenta y diario de sue&ntilde;os:</strong> tus datos de cuenta y contenido del diario (transcripciones, an&aacute;lisis, im&aacute;genes) se conservan mientras tu cuenta est&eacute; activa. Cuando eliminas tu cuenta, eliminamos o anonimizamos tus datos en un plazo razonable (generalmente dentro de 30 d&iacute;as, salvo obligaci&oacute;n legal en contrario).</li>
                    <li><strong>Grabaciones de audio:</strong> las grabaciones necesarias para la transcripci&oacute;n de voz se conservan solo durante el tiempo estrictamente necesario para el procesamiento t&eacute;cnico (generalmente unos minutos) y Noctalia no las almacena a largo plazo.</li>
                    <li><strong>Registros t&eacute;cnicos y de seguridad:</strong> conservados durante un per&iacute;odo m&aacute;ximo de 12 meses, para asegurar la seguridad, detecci&oacute;n de incidentes y evidencia en caso de disputa.</li>
                    <li><strong>Comunicaciones de soporte:</strong> conservadas durante el tiempo necesario para gestionar tu solicitud y, cuando corresponda, para defender nuestros derechos (generalmente hasta 24 meses).</li>
                </ul>
            </section>

            <section>
                <h2 class="text-2xl font-serif text-white mb-4 mt-8">7. Intercambio de datos y proveedores de servicios</h2>
                <p>Noctalia no vende tus datos personales. No mostramos publicidad dirigida en la aplicaci&oacute;n.</p>
                <p class="mt-4">Tus datos solo pueden compartirse con las siguientes categor&iacute;as de destinatarios:</p>
                <ul class="list-disc pl-5 mt-4 space-y-2">
                    <li><strong>Proveedores t&eacute;cnicos:</strong> principalmente Supabase (alojamiento, base de datos, autenticaci&oacute;n) y proveedores de infraestructura cloud necesarios para el funcionamiento de la aplicaci&oacute;n.</li>
                    <li><strong>Proveedores de IA y reconocimiento de voz:</strong> Google (Gemini, Google Cloud Speech-to-Text), y cuando corresponda otros proveedores de IA l&iacute;deres (Anthropic, OpenAI, Perplexity, Mistral, o servicios equivalentes) para transcripci&oacute;n, an&aacute;lisis de tus sue&ntilde;os y generaci&oacute;n de im&aacute;genes o contenido.</li>
                    <li><strong>Gesti&oacute;n de suscripciones:</strong> RevenueCat (USA) para la gesti&oacute;n de suscripciones in-app. RevenueCat recibe un identificador de usuario an&oacute;nimo y la informaci&oacute;n de compra proporcionada por Apple/Google. Tu informaci&oacute;n de pago completa nunca pasa por Noctalia.</li>
                    <li><strong>Asesores externos y autoridades:</strong> bufetes de abogados, contables o autoridades administrativas y judiciales cuando lo exija la ley o para defender nuestros derechos.</li>
                </ul>
                <p class="mt-4">En todos los casos, exigimos a nuestros proveedores de servicios que ofrezcan garant&iacute;as suficientes en cuanto a seguridad y confidencialidad, y que no utilicen tus datos para sus propios fines de marketing.</p>
            </section>

            <section>
                <h2 class="text-2xl font-serif text-white mb-4 mt-8">8. Usuarios menores</h2>
                <p>Noctalia est&aacute; destinada a un p&uacute;blico general pero <strong>no est&aacute; dise&ntilde;ada para ni&ntilde;os menores de 16 a&ntilde;os</strong>. No recopilamos conscientemente datos de personas menores de 16 a&ntilde;os sin el consentimiento apropiado de un titular de la autoridad parental cuando lo exija la ley.</p>
                <p class="mt-4">Si crees que un menor de 16 a&ntilde;os nos ha proporcionado datos personales sin autorizaci&oacute;n, cont&aacute;ctanos en <a href="mailto:contact@noctalia.app" class="text-dream-salmon hover:underline">contact@noctalia.app</a> para que podamos eliminar la cuenta y los datos asociados.</p>
            </section>

            <section>
                <h2 class="text-2xl font-serif text-white mb-4 mt-8">9. Tus derechos (RGPD y otras leyes aplicables)</h2>
                <p>De acuerdo con el Reglamento General de Protecci&oacute;n de Datos (RGPD) y, cuando corresponda, otras leyes aplicables, tienes los siguientes derechos sobre tus datos personales:</p>
                <ul class="list-disc pl-5 mt-4 space-y-2">
                    <li><strong>Derecho de acceso:</strong> obtener confirmaci&oacute;n de que tratamos tus datos y recibir una copia.</li>
                    <li><strong>Derecho de rectificaci&oacute;n:</strong> corregir datos inexactos o incompletos sobre ti.</li>
                    <li><strong>Derecho de supresi&oacute;n:</strong> solicitar la eliminaci&oacute;n de tus datos en los casos previstos por la ley (incluyendo la eliminaci&oacute;n de tu cuenta y diario de sue&ntilde;os).</li>
                    <li><strong>Derecho a la limitaci&oacute;n del tratamiento:</strong> solicitar la suspensi&oacute;n temporal de ciertos tratamientos.</li>
                    <li><strong>Derecho de oposici&oacute;n:</strong> oponerte a ciertos tratamientos basados en nuestro inter&eacute;s leg&iacute;timo.</li>
                    <li><strong>Derecho a la portabilidad de datos:</strong> recibir los datos que nos has proporcionado en un formato estructurado, de uso com&uacute;n y lectura mec&aacute;nica, o solicitar su transmisi&oacute;n a otro responsable cuando sea t&eacute;cnicamente factible.</li>
                    <li><strong>Derecho a retirar el consentimiento:</strong> cuando el tratamiento se base en tu consentimiento (principalmente para ciertos datos sensibles), puedes retirarlo en cualquier momento, sin afectar la licitud del tratamiento anterior.</li>
                </ul>
                <p class="mt-4">Puedes ejercer tus derechos contact&aacute;ndonos en: <a href="mailto:contact@noctalia.app" class="text-dream-salmon hover:underline">contact@noctalia.app</a>, especificando la direcci&oacute;n de email utilizada para crear tu cuenta. Podemos necesitar pedirte informaci&oacute;n adicional para verificar tu identidad.</p>
                <p class="mt-4">Si resides en el Espacio Econ&oacute;mico Europeo o el Reino Unido, tambi&eacute;n tienes derecho a presentar una reclamaci&oacute;n ante tu autoridad de control local (en Espa&ntilde;a: la AEPD).</p>
                <p class="mt-4">Si resides en una jurisdicci&oacute;n con derechos espec&iacute;ficos (por ejemplo, en California bajo la CCPA/CPRA), tambi&eacute;n puedes beneficiarte de derechos de acceso, eliminaci&oacute;n y limitaci&oacute;n del uso de tus datos. Noctalia no vende tus datos personales en el sentido de estas leyes y no practica publicidad conductual basada en seguimiento entre sitios.</p>
            </section>

            <section>
                <h2 class="text-2xl font-serif text-white mb-4 mt-8">10. Cambios en esta pol&iacute;tica</h2>
                <p>Podemos actualizar esta pol&iacute;tica de privacidad para reflejar cambios legales, t&eacute;cnicos o funcionales en Noctalia. En caso de cambios significativos, te informaremos por medios razonables (notificaci&oacute;n en la app, email o banner) antes de que entren en vigor las nuevas condiciones cuando lo exija la ley.</p>
                <p class="mt-4">La fecha de la &uacute;ltima actualizaci&oacute;n aparece en la parte superior de esta p&aacute;gina. Te animamos a revisar regularmente esta pol&iacute;tica para mantenerte informado sobre c&oacute;mo protegemos tus datos.</p>
            </section>
        </div>
    </main>

    <footer class="pb-10 pt-20 border-t border-white/5 px-6 bg-[#05020a]">
        <div class="max-w-7xl mx-auto grid grid-cols-1 md:grid-cols-4 gap-10 mb-16">
            <div class="col-span-1 md:col-span-2">
                <a href="/es/" class="flex items-center gap-2 mb-4">
                    <i data-lucide="moon" class="w-6 h-6 text-dream-salmon"></i>
                    <h4 class="font-serif text-2xl text-dream-cream">Noctalia</h4>
                </a>
                <p class="text-sm text-gray-500 max-w-xs mb-6">Tu compañero de sueños.</p>
            </div>
            <div>
                <h5 class="font-bold mb-4 text-white">Recursos</h5>
                <ul class="space-y-2 text-sm text-gray-500">
                    <li><a href="/es/blog/" class="hidden sm:inline-flex hover:text-dream-salmon transition-colors">Recursos</a></li>
                    <li><a href="/es/guides/diccionario-simbolos-suenos" class="hover:text-dream-salmon transition-colors">Simbolos de suenos</a></li>
                </ul>
            </div>
            <div>
                <h5 class="font-bold mb-4 text-white">Legal</h5>
                <ul class="space-y-2 text-sm text-gray-500">
                    <li><a href="/es/sobre" class="hover:text-dream-salmon transition-colors">Sobre</a></li>
                    <li><a href="aviso-legal" class="hover:text-dream-salmon transition-colors">Aviso legal</a></li>
                    <li><a href="politica-privacidad" class="text-dream-salmon">Privacidad</a></li>
                    <li><a href="terminos" class="hover:text-dream-salmon transition-colors">Terminos</a></li>
                </ul>
            </div>
        </div>
        <div class="text-center pt-8 border-t border-white/5 text-[10px] text-gray-600 flex flex-col md:flex-row justify-between items-center">
            <span>&copy; 2025 Noctalia Inc.</span>
            <span class="mt-2 md:mt-0 flex gap-2 items-center">Hecho con <i data-lucide="heart" class="w-3 h-3 text-dream-salmon fill-current"></i> para sonadores</span>
        </div>
    </footer>
    <script>lucide.createIcons();</script>
        <script src="/js/language-dropdown.js?v=20260108-1734" defer></script>
</body>
</html>
