{
  "meta": {
    "description": "Extended content for dream symbols - full interpretations and variations",
    "lastUpdated": "2025-01-21"
  },
  "symbols": {
    "water": {
      "en": {
        "fullInterpretation": "<p>Water is one of the most universal and powerful symbols in dream interpretation. Across cultures and throughout history, water has been associated with the depths of human emotion and the vast realm of the unconscious mind. When water appears in your dreams, it often serves as a mirror reflecting your inner emotional landscape.</p>\n<p>The state of the water in your dream provides crucial insight into your emotional well-being. Clear, calm water typically indicates emotional clarity, peace of mind, and a sense of being in harmony with yourself. You may be experiencing a period of emotional stability or have recently gained insight into a situation that was previously confusing.</p>\n<p>Conversely, murky, turbulent, or stormy water often reflects inner turmoil, unresolved emotions, or situations in your waking life that feel chaotic and overwhelming. The depth of the water can also be significant: shallow water might represent emotions you're aware of and comfortable with, while deep water could symbolize deeper feelings or unconscious material that you haven't fully explored.</p>\n<p>Water dreams can also connect to themes of purification, renewal, and transformation. Just as water cleanses and renews in the physical world, dreaming of water may indicate a desire for emotional cleansing or a fresh start in some area of your life.</p>",
        "variations": [
          { "context": "Calm, Clear Water", "meaning": "Symbolizes emotional clarity, inner peace, and mental tranquility. You may be in a period of emotional balance and self-understanding." },
          { "context": "Turbulent or Stormy Water", "meaning": "Represents emotional turmoil, inner conflict, or overwhelming feelings. You may be dealing with stress, anxiety, or unresolved emotions." },
          { "context": "Drowning", "meaning": "Suggests feeling overwhelmed by emotions or life circumstances. You may feel like you're \"in over your head\" with responsibilities or feelings." },
          { "context": "Swimming", "meaning": "Indicates actively navigating your emotional life. Swimming easily suggests confidence; struggling may reflect difficulty dealing with emotions." },
          { "context": "Flood", "meaning": "Often represents overwhelming emotions, major life changes, or feeling out of control. Can also symbolize emotional release or cleansing." }
        ]
      },
      "fr": {
        "fullInterpretation": "<p>L'eau est l'un des symboles les plus universels et puissants dans l'interprétation des rêves. À travers les cultures et l'histoire, l'eau a été associée aux profondeurs de l'émotion humaine et au vaste domaine de l'inconscient. Lorsque l'eau apparaît dans vos rêves, elle sert souvent de miroir reflétant votre paysage émotionnel intérieur.</p>\n<p>L'état de l'eau dans votre rêve fournit des indices cruciaux sur votre bien-être émotionnel. Une eau claire et calme indique généralement une clarté émotionnelle, une paix intérieure et un sentiment d'harmonie avec vous-même. Vous traversez peut-être une période de stabilité émotionnelle ou avez récemment acquis une compréhension d'une situation qui était auparavant confuse.</p>\n<p>À l'inverse, une eau trouble, turbulente ou orageuse reflète souvent des turbulences intérieures, des émotions non résolues ou des situations dans votre vie éveillée qui semblent chaotiques et accablantes. La profondeur de l'eau peut également être significative : une eau peu profonde pourrait représenter des émotions dont vous êtes conscient et avec lesquelles vous êtes à l'aise, tandis qu'une eau profonde pourrait symboliser des sentiments plus profonds ou du matériel inconscient que vous n'avez pas encore pleinement exploré.</p>\n<p>Les rêves d'eau peuvent également se connecter à des thèmes de purification, de renouveau et de transformation. Tout comme l'eau nettoie et renouvelle dans le monde physique, rêver d'eau peut indiquer un désir de nettoyage émotionnel ou un nouveau départ dans un domaine de votre vie.</p>",
        "variations": [
          { "context": "Eau calme et claire", "meaning": "Symbolise la clarté émotionnelle, la paix intérieure et la tranquillité mentale. Vous êtes peut-être dans une période d'équilibre émotionnel et de compréhension de soi." },
          { "context": "Eau turbulente ou orageuse", "meaning": "Représente des turbulences émotionnelles, des conflits intérieurs ou des sentiments accablants. Vous faites peut-être face au stress, à l'anxiété ou à des émotions non résolues." },
          { "context": "Se noyer", "meaning": "Suggère de se sentir submergé par les émotions ou les circonstances de la vie. Vous avez peut-être l'impression d'être \"dépassé\" par les responsabilités ou les sentiments." },
          { "context": "Nager", "meaning": "Indique une navigation active dans votre vie émotionnelle. Nager facilement suggère la confiance ; lutter peut refléter des difficultés à gérer les émotions." },
          { "context": "Inondation", "meaning": "Représente souvent des émotions accablantes, des changements majeurs dans la vie ou un sentiment de perte de contrôle. Peut aussi symboliser une libération émotionnelle ou une purification." }
        ]
      },
      "es": {
        "fullInterpretation": "<p>El agua es uno de los símbolos más universales y poderosos en la interpretación de sueños. A través de las culturas y la historia, el agua ha sido asociada con las profundidades de la emoción humana y el vasto reino de la mente inconsciente. Cuando el agua aparece en tus sueños, a menudo sirve como un espejo que refleja tu paisaje emocional interior.</p>\n<p>El estado del agua en tu sueño proporciona información crucial sobre tu bienestar emocional. El agua clara y tranquila típicamente indica claridad emocional, paz mental y una sensación de estar en armonía contigo mismo. Puedes estar experimentando un período de estabilidad emocional o haber ganado recientemente perspectiva sobre una situación que antes era confusa.</p>\n<p>Por el contrario, el agua turbia, turbulenta u tormentosa a menudo refleja turbulencias internas, emociones no resueltas o situaciones en tu vida despierta que se sienten caóticas y abrumadoras. La profundidad del agua también puede ser significativa: el agua poco profunda podría representar emociones de las que eres consciente y con las que te sientes cómodo, mientras que el agua profunda podría simbolizar sentimientos más profundos o material inconsciente que no has explorado completamente.</p>\n<p>Los sueños con agua también pueden conectar con temas de purificación, renovación y transformación. Así como el agua limpia y renueva en el mundo físico, soñar con agua puede indicar un deseo de limpieza emocional o un nuevo comienzo en algún área de tu vida.</p>",
        "variations": [
          { "context": "Agua clara y tranquila", "meaning": "Simboliza claridad emocional, paz interior y tranquilidad mental. Puedes estar en un período de equilibrio emocional y autocomprensión." },
          { "context": "Agua turbulenta o tormentosa", "meaning": "Representa turbulencia emocional, conflicto interno o sentimientos abrumadores. Puedes estar lidiando con estrés, ansiedad o emociones no resueltas." },
          { "context": "Ahogarse", "meaning": "Sugiere sentirse abrumado por las emociones o circunstancias de la vida. Puedes sentir que estás \"sobre tu cabeza\" con responsabilidades o sentimientos." },
          { "context": "Nadar", "meaning": "Indica navegar activamente tu vida emocional. Nadar fácilmente sugiere confianza; luchar puede reflejar dificultad para manejar emociones." },
          { "context": "Inundación", "meaning": "A menudo representa emociones abrumadoras, cambios importantes en la vida o sentirse fuera de control. También puede simbolizar liberación emocional o limpieza." }
        ]
      }
    },
    "teeth": {
      "en": {
        "fullInterpretation": "<p>Dreams about teeth, particularly losing teeth, are among the most commonly reported dreams worldwide. This universal dream theme cuts across cultures and age groups, suggesting it touches on deeply rooted psychological concerns shared by humanity.</p>\n<p>At its core, teeth dreams often relate to anxiety about self-image and how others perceive us. Teeth are central to our appearance and our ability to communicate—two fundamental aspects of social interaction. When teeth fall out in dreams, it may reflect concerns about losing attractiveness, aging, or social standing.</p>\n<p>From a psychological perspective, teeth also represent power and confidence. We use expressions like \"sinking our teeth into something\" or \"having bite.\" Losing teeth in a dream might symbolize feeling powerless in a situation, losing your grip on something important, or experiencing a blow to your confidence.</p>\n<p>Some interpretations connect teeth dreams to communication issues. Teeth are essential for speech, so dreams about tooth loss might indicate difficulty expressing yourself, fear of saying the wrong thing, or regret over something you've said. Consider whether there's something important you need to communicate but feel unable to.</p>",
        "variations": [
          { "context": "Teeth falling out", "meaning": "The most common variation, often symbolizing anxiety, fear of loss, concerns about appearance, or feeling powerless in a situation." },
          { "context": "Teeth crumbling", "meaning": "May represent gradual loss of confidence, deteriorating self-image, or a situation that's slowly falling apart despite your efforts." },
          { "context": "Loose teeth", "meaning": "Suggests instability or insecurity about something you thought was solid—a relationship, job, or belief system may be wavering." },
          { "context": "Pulling out your own teeth", "meaning": "Could indicate taking control of a difficult situation, making a painful but necessary change, or self-criticism." },
          { "context": "Growing new teeth", "meaning": "A positive sign representing renewal, personal growth, gaining new confidence, or a fresh start in some area of life." }
        ]
      },
      "fr": {
        "fullInterpretation": "<p>Les rêves de dents, en particulier de perdre ses dents, sont parmi les rêves les plus fréquemment rapportés dans le monde. Ce thème de rêve universel transcende les cultures et les groupes d'âge, suggérant qu'il touche à des préoccupations psychologiques profondément enracinées partagées par l'humanité.</p>\n<p>Fondamentalement, les rêves de dents sont souvent liés à l'anxiété concernant l'image de soi et la façon dont les autres nous perçoivent. Les dents sont centrales pour notre apparence et notre capacité à communiquer—deux aspects fondamentaux de l'interaction sociale. Quand les dents tombent dans les rêves, cela peut refléter des préoccupations concernant la perte d'attractivité, le vieillissement ou le statut social.</p>\n<p>D'un point de vue psychologique, les dents représentent également le pouvoir et la confiance. On utilise des expressions comme \"mordre dans quelque chose\" ou \"avoir de la mordant\". Perdre ses dents dans un rêve pourrait symboliser un sentiment d'impuissance face à une situation, perdre prise sur quelque chose d'important, ou subir un coup à votre confiance.</p>\n<p>Certaines interprétations connectent les rêves de dents aux problèmes de communication. Les dents sont essentielles pour la parole, donc les rêves de perte de dents pourraient indiquer une difficulté à vous exprimer, une peur de dire la mauvaise chose, ou des regrets concernant quelque chose que vous avez dit.</p>",
        "variations": [
          { "context": "Dents qui tombent", "meaning": "La variation la plus courante, symbolisant souvent l'anxiété, la peur de la perte, les préoccupations concernant l'apparence ou le sentiment d'impuissance." },
          { "context": "Dents qui s'effritent", "meaning": "Peut représenter une perte progressive de confiance, une image de soi qui se détériore, ou une situation qui s'effondre lentement malgré vos efforts." },
          { "context": "Dents qui bougent", "meaning": "Suggère une instabilité ou une insécurité concernant quelque chose que vous pensiez solide—une relation, un emploi ou un système de croyances peut vaciller." },
          { "context": "S'arracher ses propres dents", "meaning": "Pourrait indiquer prendre le contrôle d'une situation difficile, faire un changement douloureux mais nécessaire, ou de l'autocritique." },
          { "context": "Nouvelles dents qui poussent", "meaning": "Un signe positif représentant le renouveau, la croissance personnelle, une nouvelle confiance, ou un nouveau départ dans un domaine de la vie." }
        ]
      },
      "es": {
        "fullInterpretation": "<p>Los sueños sobre dientes, particularmente perder dientes, están entre los sueños más comúnmente reportados en todo el mundo. Este tema de sueño universal atraviesa culturas y grupos de edad, sugiriendo que toca preocupaciones psicológicas profundamente arraigadas compartidas por la humanidad.</p>\n<p>En esencia, los sueños de dientes a menudo se relacionan con la ansiedad sobre la autoimagen y cómo nos perciben los demás. Los dientes son centrales para nuestra apariencia y nuestra capacidad de comunicarnos—dos aspectos fundamentales de la interacción social. Cuando los dientes se caen en los sueños, puede reflejar preocupaciones sobre perder atractivo, envejecer o el estatus social.</p>\n<p>Desde una perspectiva psicológica, los dientes también representan poder y confianza. Usamos expresiones como \"hincar el diente\" o \"tener mordida\". Perder dientes en un sueño podría simbolizar sentirse impotente en una situación, perder el control de algo importante, o experimentar un golpe a tu confianza.</p>\n<p>Algunas interpretaciones conectan los sueños de dientes con problemas de comunicación. Los dientes son esenciales para el habla, por lo que los sueños sobre pérdida de dientes podrían indicar dificultad para expresarte, miedo a decir algo incorrecto, o arrepentimiento por algo que has dicho.</p>",
        "variations": [
          { "context": "Dientes que se caen", "meaning": "La variación más común, a menudo simbolizando ansiedad, miedo a la pérdida, preocupaciones sobre la apariencia o sentirse impotente." },
          { "context": "Dientes que se desmoronan", "meaning": "Puede representar pérdida gradual de confianza, imagen propia deteriorándose, o una situación que se desmorona lentamente a pesar de tus esfuerzos." },
          { "context": "Dientes flojos", "meaning": "Sugiere inestabilidad o inseguridad sobre algo que pensabas sólido—una relación, trabajo o sistema de creencias puede estar tambaleándose." },
          { "context": "Arrancarte tus propios dientes", "meaning": "Podría indicar tomar control de una situación difícil, hacer un cambio doloroso pero necesario, o autocrítica." },
          { "context": "Crecimiento de nuevos dientes", "meaning": "Una señal positiva que representa renovación, crecimiento personal, nueva confianza, o un nuevo comienzo en algún área de la vida." }
        ]
      }
    },
    "falling": {
      "en": {
        "fullInterpretation": "<p>Falling dreams are among the most universal human dream experiences. Almost everyone has had a falling dream at some point in their lives, and the sensation often feels remarkably real—sometimes even causing a physical jolt that wakes us up.</p>\n<p>At their most basic level, falling dreams typically represent a loss of control. You may be feeling overwhelmed by circumstances in your waking life, facing a situation where you feel powerless, or experiencing anxiety about something that seems beyond your ability to manage. The falling sensation mirrors that helpless feeling of events spiraling beyond your control.</p>\n<p>Falling dreams can also reflect fears of failure. If you're taking on new responsibilities, facing a major life transition, or worried about not meeting expectations, your mind might express these anxieties through the metaphor of falling. The fear of \"falling short\" or \"falling from grace\" manifests literally in the dream state.</p>\n<p>Interestingly, some interpretations suggest that falling dreams can indicate a need to let go. Rather than fighting for control, sometimes we need to release our grip and trust the process. If you frequently have falling dreams, consider whether there's something in your life you're holding onto too tightly.</p>",
        "variations": [
          { "context": "Falling from a height", "meaning": "Often represents fear of failure, loss of status, or anxiety about a situation where you feel you have a lot to lose." },
          { "context": "Falling into darkness", "meaning": "May symbolize fear of the unknown, depression, or venturing into unexplored territory in your life." },
          { "context": "Falling and then flying", "meaning": "A positive transformation—turning fear into freedom, finding control in chaos, or overcoming obstacles." },
          { "context": "Falling slowly", "meaning": "Suggests a gradual loss of control or a transition that feels inevitable but not necessarily threatening." },
          { "context": "Catching yourself while falling", "meaning": "Indicates resilience, finding inner strength, or the ability to recover from setbacks." }
        ]
      },
      "fr": {
        "fullInterpretation": "<p>Les rêves de chute sont parmi les expériences de rêve les plus universelles. Presque tout le monde a fait un rêve de chute à un moment de sa vie, et la sensation semble souvent remarquablement réelle—parfois même causant un sursaut physique qui nous réveille.</p>\n<p>À leur niveau le plus basique, les rêves de chute représentent généralement une perte de contrôle. Vous vous sentez peut-être submergé par les circonstances de votre vie éveillée, faisant face à une situation où vous vous sentez impuissant, ou éprouvant de l'anxiété face à quelque chose qui semble au-delà de votre capacité à gérer. La sensation de chute reflète ce sentiment d'impuissance face à des événements qui échappent à votre contrôle.</p>\n<p>Les rêves de chute peuvent également refléter des peurs d'échec. Si vous assumez de nouvelles responsabilités, faites face à une transition majeure dans votre vie, ou êtes inquiet de ne pas répondre aux attentes, votre esprit pourrait exprimer ces anxiétés à travers la métaphore de la chute. La peur d'\"échouer\" ou de \"tomber en disgrâce\" se manifeste littéralement dans l'état de rêve.</p>\n<p>Intéressant, certaines interprétations suggèrent que les rêves de chute peuvent indiquer un besoin de lâcher prise. Plutôt que de lutter pour le contrôle, parfois nous devons relâcher notre emprise et faire confiance au processus.</p>",
        "variations": [
          { "context": "Tomber d'une hauteur", "meaning": "Représente souvent la peur de l'échec, la perte de statut, ou l'anxiété face à une situation où vous sentez avoir beaucoup à perdre." },
          { "context": "Tomber dans l'obscurité", "meaning": "Peut symboliser la peur de l'inconnu, la dépression, ou s'aventurer en territoire inexploré dans votre vie." },
          { "context": "Tomber puis voler", "meaning": "Une transformation positive—transformer la peur en liberté, trouver le contrôle dans le chaos, ou surmonter les obstacles." },
          { "context": "Tomber lentement", "meaning": "Suggère une perte graduelle de contrôle ou une transition qui semble inévitable mais pas nécessairement menaçante." },
          { "context": "Se rattraper en tombant", "meaning": "Indique la résilience, trouver une force intérieure, ou la capacité de se remettre des revers." }
        ]
      },
      "es": {
        "fullInterpretation": "<p>Los sueños de caer están entre las experiencias de sueño más universales. Casi todos han tenido un sueño de caída en algún momento de sus vidas, y la sensación a menudo se siente notablemente real—a veces incluso causando un sobresalto físico que nos despierta.</p>\n<p>En su nivel más básico, los sueños de caída típicamente representan una pérdida de control. Puedes sentirte abrumado por las circunstancias en tu vida despierta, enfrentando una situación donde te sientes impotente, o experimentando ansiedad sobre algo que parece estar más allá de tu capacidad de manejar. La sensación de caída refleja ese sentimiento de impotencia ante eventos que se salen de control.</p>\n<p>Los sueños de caída también pueden reflejar miedos al fracaso. Si estás asumiendo nuevas responsabilidades, enfrentando una transición importante en tu vida, o preocupado por no cumplir las expectativas, tu mente podría expresar estas ansiedades a través de la metáfora de caer. El miedo a \"quedarse corto\" o \"caer en desgracia\" se manifiesta literalmente en el estado de sueño.</p>\n<p>Interesantemente, algunas interpretaciones sugieren que los sueños de caída pueden indicar una necesidad de soltar. En lugar de luchar por el control, a veces necesitamos soltar y confiar en el proceso.</p>",
        "variations": [
          { "context": "Caer desde una altura", "meaning": "A menudo representa miedo al fracaso, pérdida de estatus, o ansiedad sobre una situación donde sientes que tienes mucho que perder." },
          { "context": "Caer en la oscuridad", "meaning": "Puede simbolizar miedo a lo desconocido, depresión, o aventurarse en territorio inexplorado en tu vida." },
          { "context": "Caer y luego volar", "meaning": "Una transformación positiva—convertir el miedo en libertad, encontrar control en el caos, o superar obstáculos." },
          { "context": "Caer lentamente", "meaning": "Sugiere una pérdida gradual de control o una transición que se siente inevitable pero no necesariamente amenazante." },
          { "context": "Agarrarte mientras caes", "meaning": "Indica resiliencia, encontrar fuerza interior, o la capacidad de recuperarte de los contratiempos." }
        ]
      }
    },
    "flying": {
      "en": {
        "fullInterpretation": "<p>Flying dreams are often among the most exhilarating dream experiences we can have. Unlike falling dreams, which typically induce anxiety, flying dreams usually bring feelings of joy, freedom, and empowerment. These dreams can leave us feeling uplifted for hours after waking.</p>\n<p>At their heart, flying dreams represent liberation and transcendence. When you soar above the ground in a dream, you've temporarily escaped the constraints and limitations of everyday life. This could reflect a desire for freedom from responsibilities, relationships, or situations that feel confining in your waking life.</p>\n<p>Flying also symbolizes perspective and rising above problems. From high above, you can see the bigger picture. Flying dreams might come during times when you need to step back from a situation and view it from a new angle, or when you've gained insight that helps you see past immediate concerns.</p>\n<p>The ease or difficulty of your flight matters greatly in interpretation. Effortless soaring suggests confidence, control, and a sense that you're on the right path. Struggling to fly, flying low, or falling during flight might indicate obstacles, self-doubt, or challenges you're facing in achieving your goals.</p>",
        "variations": [
          { "context": "Soaring freely", "meaning": "Represents freedom, achievement, and feeling in control of your destiny. You may be experiencing a high point in your life." },
          { "context": "Struggling to fly", "meaning": "Suggests obstacles, self-doubt, or challenges in achieving your goals. Something may be holding you back." },
          { "context": "Flying low to the ground", "meaning": "May indicate being cautious, not fully committing to your ambitions, or staying safe rather than taking risks." },
          { "context": "Flying to escape danger", "meaning": "Represents avoiding problems or seeking freedom from a threatening situation in your waking life." },
          { "context": "Teaching others to fly", "meaning": "Could symbolize mentorship, sharing knowledge, or helping others achieve their potential." }
        ]
      },
      "fr": {
        "fullInterpretation": "<p>Les rêves de vol sont souvent parmi les expériences de rêve les plus exaltantes que nous puissions avoir. Contrairement aux rêves de chute, qui induisent généralement de l'anxiété, les rêves de vol apportent habituellement des sentiments de joie, de liberté et d'autonomisation. Ces rêves peuvent nous laisser un sentiment d'élévation pendant des heures après le réveil.</p>\n<p>Au cœur, les rêves de vol représentent la libération et la transcendance. Quand vous planez au-dessus du sol dans un rêve, vous avez temporairement échappé aux contraintes et limitations de la vie quotidienne. Cela pourrait refléter un désir de liberté des responsabilités, relations ou situations qui semblent confinantes dans votre vie éveillée.</p>\n<p>Voler symbolise également la perspective et s'élever au-dessus des problèmes. De très haut, vous pouvez voir l'ensemble de la situation. Les rêves de vol pourraient venir pendant les moments où vous avez besoin de prendre du recul et de voir une situation sous un nouvel angle.</p>\n<p>La facilité ou la difficulté de votre vol compte beaucoup dans l'interprétation. Planer sans effort suggère la confiance, le contrôle et le sentiment d'être sur le bon chemin. Lutter pour voler ou voler bas pourrait indiquer des obstacles ou des défis.</p>",
        "variations": [
          { "context": "Planer librement", "meaning": "Représente la liberté, l'accomplissement et le sentiment de contrôler son destin. Vous vivez peut-être un point culminant de votre vie." },
          { "context": "Lutter pour voler", "meaning": "Suggère des obstacles, des doutes sur soi, ou des défis pour atteindre vos objectifs. Quelque chose peut vous retenir." },
          { "context": "Voler près du sol", "meaning": "Peut indiquer être prudent, ne pas s'engager pleinement dans vos ambitions, ou rester en sécurité plutôt que de prendre des risques." },
          { "context": "Voler pour échapper au danger", "meaning": "Représente l'évitement de problèmes ou la recherche de liberté face à une situation menaçante." },
          { "context": "Enseigner aux autres à voler", "meaning": "Pourrait symboliser le mentorat, le partage de connaissances, ou aider les autres à atteindre leur potentiel." }
        ]
      },
      "es": {
        "fullInterpretation": "<p>Los sueños de volar están a menudo entre las experiencias de sueño más estimulantes que podemos tener. A diferencia de los sueños de caer, que típicamente inducen ansiedad, los sueños de volar usualmente traen sentimientos de alegría, libertad y empoderamiento. Estos sueños pueden dejarnos sintiéndonos elevados durante horas después de despertar.</p>\n<p>En su esencia, los sueños de volar representan liberación y trascendencia. Cuando te elevas sobre el suelo en un sueño, has escapado temporalmente de las restricciones y limitaciones de la vida cotidiana. Esto podría reflejar un deseo de libertad de responsabilidades, relaciones o situaciones que se sienten confinantes en tu vida despierta.</p>\n<p>Volar también simboliza perspectiva y elevarse por encima de los problemas. Desde lo alto, puedes ver el panorama completo. Los sueños de volar podrían venir durante momentos cuando necesitas alejarte de una situación y verla desde un nuevo ángulo.</p>\n<p>La facilidad o dificultad de tu vuelo importa mucho en la interpretación. Volar sin esfuerzo sugiere confianza, control y la sensación de estar en el camino correcto. Luchar para volar o volar bajo podría indicar obstáculos o desafíos.</p>",
        "variations": [
          { "context": "Volar libremente", "meaning": "Representa libertad, logro y sentir control sobre tu destino. Puedes estar experimentando un punto alto en tu vida." },
          { "context": "Luchar para volar", "meaning": "Sugiere obstáculos, dudas sobre ti mismo, o desafíos para alcanzar tus metas. Algo puede estar reteniéndote." },
          { "context": "Volar cerca del suelo", "meaning": "Puede indicar ser cauteloso, no comprometerse completamente con tus ambiciones, o mantenerte seguro en lugar de tomar riesgos." },
          { "context": "Volar para escapar del peligro", "meaning": "Representa evitar problemas o buscar libertad de una situación amenazante en tu vida despierta." },
          { "context": "Enseñar a otros a volar", "meaning": "Podría simbolizar mentoría, compartir conocimiento, o ayudar a otros a alcanzar su potencial." }
        ]
      }
    },
    "snake": {
      "en": {
        "fullInterpretation": "<p>The snake is one of the oldest and most complex symbols in human culture, appearing in myths, religions, and dreams across every civilization. In dreams, snakes carry particularly rich and often contradictory meanings, making them fascinating but challenging to interpret.</p>\n<p>Perhaps the most fundamental meaning of snakes in dreams is transformation and renewal. Snakes shed their skin, emerging renewed—a powerful metaphor for personal transformation, healing, and starting fresh. If a snake appears in your dream during a time of significant change, it may be acknowledging this transformation.</p>\n<p>Snakes also carry strong associations with instinct, primal energy, and the unconscious mind. They move close to the earth, operate on instinct, and can strike without warning. A snake in your dream might represent aspects of yourself or your life that operate on a more primal, instinctual level—sexuality, aggression, fear, or deeply buried emotions.</p>\n<p>The emotional tone of your snake dream matters greatly. Fear in the dream might point to something threatening in your waking life, while a calm interaction could suggest wisdom, healing, or spiritual insight. Your personal feelings about snakes also influence the dream's meaning significantly.</p>",
        "variations": [
          { "context": "Being bitten by a snake", "meaning": "Often represents a wake-up call, hidden threat, or toxic influence in your life that needs attention." },
          { "context": "A friendly or calm snake", "meaning": "May symbolize wisdom, healing energy, spiritual awakening, or reconciliation with fears." },
          { "context": "Killing a snake", "meaning": "Could represent overcoming fears, defeating enemies, or ending a toxic situation in your life." },
          { "context": "Multiple snakes", "meaning": "Might indicate feeling overwhelmed by threats, complex emotions, or multiple issues needing attention." },
          { "context": "A snake shedding skin", "meaning": "Powerful symbol of transformation, renewal, leaving the old behind and embracing change." }
        ]
      },
      "fr": {
        "fullInterpretation": "<p>Le serpent est l'un des symboles les plus anciens et les plus complexes de la culture humaine, apparaissant dans les mythes, les religions et les rêves à travers toutes les civilisations. Dans les rêves, les serpents portent des significations particulièrement riches et souvent contradictoires.</p>\n<p>Peut-être la signification la plus fondamentale des serpents dans les rêves est la transformation et le renouveau. Les serpents muent, émergeant renouvelés—une puissante métaphore de la transformation personnelle, de la guérison et d'un nouveau départ. Si un serpent apparaît dans votre rêve pendant une période de changement significatif, il peut reconnaître cette transformation.</p>\n<p>Les serpents portent également de fortes associations avec l'instinct, l'énergie primale et l'inconscient. Ils se déplacent près de la terre, fonctionnent par instinct et peuvent frapper sans avertissement. Un serpent dans votre rêve pourrait représenter des aspects de vous-même ou de votre vie qui fonctionnent à un niveau plus primal et instinctif.</p>\n<p>Le ton émotionnel de votre rêve de serpent compte beaucoup. La peur dans le rêve pourrait pointer vers quelque chose de menaçant dans votre vie éveillée, tandis qu'une interaction calme pourrait suggérer la sagesse, la guérison ou une perspicacité spirituelle.</p>",
        "variations": [
          { "context": "Être mordu par un serpent", "meaning": "Représente souvent un signal d'alarme, une menace cachée, ou une influence toxique dans votre vie qui nécessite attention." },
          { "context": "Un serpent amical ou calme", "meaning": "Peut symboliser la sagesse, l'énergie de guérison, l'éveil spirituel, ou la réconciliation avec les peurs." },
          { "context": "Tuer un serpent", "meaning": "Pourrait représenter surmonter ses peurs, vaincre des ennemis, ou mettre fin à une situation toxique." },
          { "context": "Plusieurs serpents", "meaning": "Pourrait indiquer se sentir submergé par les menaces, des émotions complexes, ou plusieurs problèmes nécessitant attention." },
          { "context": "Un serpent qui mue", "meaning": "Puissant symbole de transformation, de renouveau, de laisser l'ancien derrière et d'embrasser le changement." }
        ]
      },
      "es": {
        "fullInterpretation": "<p>La serpiente es uno de los símbolos más antiguos y complejos de la cultura humana, apareciendo en mitos, religiones y sueños a través de todas las civilizaciones. En los sueños, las serpientes llevan significados particularmente ricos y a menudo contradictorios.</p>\n<p>Quizás el significado más fundamental de las serpientes en los sueños es la transformación y renovación. Las serpientes mudan su piel, emergiendo renovadas—una poderosa metáfora de la transformación personal, la sanación y comenzar de nuevo. Si una serpiente aparece en tu sueño durante un tiempo de cambio significativo, puede estar reconociendo esta transformación.</p>\n<p>Las serpientes también llevan fuertes asociaciones con el instinto, la energía primaria y la mente inconsciente. Se mueven cerca de la tierra, operan por instinto y pueden atacar sin advertencia. Una serpiente en tu sueño podría representar aspectos de ti mismo o tu vida que operan en un nivel más primario e instintivo.</p>\n<p>El tono emocional de tu sueño de serpiente importa mucho. El miedo en el sueño podría señalar algo amenazante en tu vida despierta, mientras que una interacción tranquila podría sugerir sabiduría, sanación o perspicacia espiritual.</p>",
        "variations": [
          { "context": "Ser mordido por una serpiente", "meaning": "A menudo representa una llamada de atención, amenaza oculta, o influencia tóxica en tu vida que necesita atención." },
          { "context": "Una serpiente amigable o tranquila", "meaning": "Puede simbolizar sabiduría, energía sanadora, despertar espiritual, o reconciliación con los miedos." },
          { "context": "Matar una serpiente", "meaning": "Podría representar superar miedos, derrotar enemigos, o terminar una situación tóxica en tu vida." },
          { "context": "Múltiples serpientes", "meaning": "Podría indicar sentirse abrumado por amenazas, emociones complejas, o múltiples asuntos que necesitan atención." },
          { "context": "Una serpiente mudando piel", "meaning": "Poderoso símbolo de transformación, renovación, dejar atrás lo viejo y abrazar el cambio." }
        ]
      }
    },
    "death": {
      "en": {
        "fullInterpretation": "<p>Dreams about death are among the most disturbing we can experience, often leaving us shaken and anxious upon waking. However, it's crucial to understand that death in dreams rarely—if ever—predicts actual death. Instead, death dreams are rich with symbolic meaning about transformation and change.</p>\n<p>The most common interpretation of death dreams is that they represent endings and new beginnings. Something in your life is coming to an end—a relationship, a job, a phase of life, a way of thinking, or an old version of yourself. The death symbolizes this ending, making way for something new to emerge. In this sense, death dreams can actually be positive, signaling growth and transformation.</p>\n<p>Death dreams may also reflect anxiety about change or the unknown. Major life transitions—even positive ones—can trigger these dreams as your subconscious processes the \"death\" of your old life or identity. Starting a new job, ending a relationship, moving to a new city, or becoming a parent might all manifest as death imagery in dreams.</p>\n<p>If you dream of someone else dying, consider what that person represents to you. They might symbolize a quality, relationship, or aspect of your life that is changing or needs to change. Dreaming of a loved one's death often reflects fear of loss rather than any literal prediction.</p>",
        "variations": [
          { "context": "Your own death", "meaning": "Often represents major personal transformation, the end of one chapter of life, or letting go of an old identity." },
          { "context": "Death of a loved one", "meaning": "May reflect fear of losing that person, or the \"death\" of your relationship dynamic with them." },
          { "context": "Death of a stranger", "meaning": "Could symbolize an aspect of yourself you don't fully recognize that's undergoing change." },
          { "context": "Attending a funeral", "meaning": "Suggests processing endings, grief, or preparing to say goodbye to something in your life." },
          { "context": "Coming back from death", "meaning": "A powerful symbol of renewal, second chances, and emerging transformed from difficult experiences." }
        ]
      },
      "fr": {
        "fullInterpretation": "<p>Les rêves de mort sont parmi les plus perturbants que nous puissions vivre, nous laissant souvent secoués et anxieux au réveil. Cependant, il est crucial de comprendre que la mort dans les rêves prédit rarement—voire jamais—une mort réelle. Au lieu de cela, les rêves de mort sont riches en signification symbolique sur la transformation et le changement.</p>\n<p>L'interprétation la plus courante des rêves de mort est qu'ils représentent des fins et de nouveaux départs. Quelque chose dans votre vie touche à sa fin—une relation, un emploi, une phase de vie, une façon de penser, ou une ancienne version de vous-même. La mort symbolise cette fin, faisant place à quelque chose de nouveau pour émerger.</p>\n<p>Les rêves de mort peuvent également refléter l'anxiété face au changement ou à l'inconnu. Les transitions majeures de vie—même positives—peuvent déclencher ces rêves alors que votre subconscient traite la \"mort\" de votre ancienne vie ou identité.</p>\n<p>Si vous rêvez de la mort de quelqu'un d'autre, considérez ce que cette personne représente pour vous. Elle pourrait symboliser une qualité, une relation ou un aspect de votre vie qui change ou doit changer.</p>",
        "variations": [
          { "context": "Votre propre mort", "meaning": "Représente souvent une transformation personnelle majeure, la fin d'un chapitre de vie, ou le lâcher prise d'une ancienne identité." },
          { "context": "Mort d'un être cher", "meaning": "Peut refléter la peur de perdre cette personne, ou la \"mort\" de votre dynamique relationnelle avec elle." },
          { "context": "Mort d'un inconnu", "meaning": "Pourrait symboliser un aspect de vous-même que vous ne reconnaissez pas pleinement et qui subit un changement." },
          { "context": "Assister à des funérailles", "meaning": "Suggère le traitement des fins, le deuil, ou la préparation à dire au revoir à quelque chose dans votre vie." },
          { "context": "Revenir de la mort", "meaning": "Un puissant symbole de renouveau, de secondes chances, et d'émergence transformée d'expériences difficiles." }
        ]
      },
      "es": {
        "fullInterpretation": "<p>Los sueños sobre la muerte están entre los más perturbadores que podemos experimentar, a menudo dejándonos sacudidos y ansiosos al despertar. Sin embargo, es crucial entender que la muerte en los sueños rara vez—si alguna vez—predice muerte real. En cambio, los sueños de muerte son ricos en significado simbólico sobre transformación y cambio.</p>\n<p>La interpretación más común de los sueños de muerte es que representan finales y nuevos comienzos. Algo en tu vida está llegando a su fin—una relación, un trabajo, una fase de vida, una forma de pensar, o una versión antigua de ti mismo. La muerte simboliza este final, dando paso a algo nuevo para emerger.</p>\n<p>Los sueños de muerte también pueden reflejar ansiedad sobre el cambio o lo desconocido. Las transiciones importantes de vida—incluso las positivas—pueden desencadenar estos sueños mientras tu subconsciente procesa la \"muerte\" de tu vieja vida o identidad.</p>\n<p>Si sueñas con la muerte de alguien más, considera qué representa esa persona para ti. Podría simbolizar una cualidad, relación o aspecto de tu vida que está cambiando o necesita cambiar.</p>",
        "variations": [
          { "context": "Tu propia muerte", "meaning": "A menudo representa una transformación personal importante, el final de un capítulo de vida, o dejar ir una vieja identidad." },
          { "context": "Muerte de un ser querido", "meaning": "Puede reflejar miedo a perder a esa persona, o la \"muerte\" de tu dinámica de relación con ella." },
          { "context": "Muerte de un extraño", "meaning": "Podría simbolizar un aspecto de ti mismo que no reconoces completamente y que está experimentando cambio." },
          { "context": "Asistir a un funeral", "meaning": "Sugiere procesar finales, duelo, o prepararse para despedirse de algo en tu vida." },
          { "context": "Regresar de la muerte", "meaning": "Un poderoso símbolo de renovación, segundas oportunidades, y emerger transformado de experiencias difíciles." }
        ]
      }
    },
    "chase": {
      "en": {
        "fullInterpretation": "<p>Being chased in a dream is one of the most common and anxiety-provoking dream themes experienced worldwide. These dreams often feel intensely real, complete with racing heart, sweating, and that desperate feeling of running but not being able to escape. Understanding what chase dreams mean can provide valuable insight into your waking life.</p>\n<p>At their core, chase dreams typically represent avoidance. Whatever is chasing you in the dream often symbolizes something you're running from in your waking life—a problem you don't want to face, an emotion you're suppressing, a responsibility you're avoiding, or a fear you haven't confronted. The dream is your subconscious mind's way of drawing attention to this avoidance.</p>\n<p>The identity of the pursuer matters greatly. Being chased by an unknown figure might represent vague, unnamed fears or anxieties. Being chased by an animal could connect to primal fears or instincts. Being chased by someone you know might reflect issues in that relationship or qualities they represent that you're avoiding in yourself.</p>\n<p>Pay attention to how the chase ends. Escaping successfully might indicate you have the resources to handle your challenges. Being caught could suggest it's time to stop running and face what you've been avoiding. Some people find that turning to face their pursuer transforms the dream entirely—a powerful message about confronting rather than fleeing from our fears.</p>",
        "variations": [
          { "context": "Being chased by an unknown figure", "meaning": "Often represents vague fears, unnamed anxiety, or aspects of yourself you haven't fully acknowledged." },
          { "context": "Being chased by an animal", "meaning": "May symbolize primal fears, instincts, or natural forces in your life that feel threatening." },
          { "context": "Being chased by someone you know", "meaning": "Could reflect issues with that person or qualities they represent that you're avoiding in yourself." },
          { "context": "Running but unable to move", "meaning": "Suggests feeling powerless, stuck, or unable to escape a situation despite your efforts." },
          { "context": "Turning to face your pursuer", "meaning": "Represents courage, confronting fears, and readiness to address what you've been avoiding." }
        ]
      },
      "fr": {
        "fullInterpretation": "<p>Être poursuivi dans un rêve est l'un des thèmes de rêve les plus courants et anxiogènes expérimentés dans le monde. Ces rêves semblent souvent intensément réels, complets avec un cœur qui bat, de la transpiration, et ce sentiment désespéré de courir sans pouvoir s'échapper.</p>\n<p>Fondamentalement, les rêves de poursuite représentent généralement l'évitement. Ce qui vous poursuit dans le rêve symbolise souvent quelque chose que vous fuyez dans votre vie éveillée—un problème que vous ne voulez pas affronter, une émotion que vous réprimez, une responsabilité que vous évitez, ou une peur que vous n'avez pas confrontée.</p>\n<p>L'identité du poursuivant compte beaucoup. Être poursuivi par une figure inconnue pourrait représenter des peurs vagues et sans nom. Être poursuivi par un animal pourrait se connecter à des peurs primales ou des instincts. Être poursuivi par quelqu'un que vous connaissez pourrait refléter des problèmes dans cette relation.</p>\n<p>Faites attention à comment la poursuite se termine. S'échapper avec succès pourrait indiquer que vous avez les ressources pour gérer vos défis. Être attrapé pourrait suggérer qu'il est temps d'arrêter de courir et d'affronter ce que vous avez évité.</p>",
        "variations": [
          { "context": "Être poursuivi par une figure inconnue", "meaning": "Représente souvent des peurs vagues, une anxiété sans nom, ou des aspects de vous-même que vous n'avez pas pleinement reconnus." },
          { "context": "Être poursuivi par un animal", "meaning": "Peut symboliser des peurs primales, des instincts, ou des forces naturelles dans votre vie qui semblent menaçantes." },
          { "context": "Être poursuivi par quelqu'un que vous connaissez", "meaning": "Pourrait refléter des problèmes avec cette personne ou des qualités qu'elle représente que vous évitez en vous-même." },
          { "context": "Courir mais incapable de bouger", "meaning": "Suggère se sentir impuissant, coincé, ou incapable d'échapper à une situation malgré vos efforts." },
          { "context": "Se retourner pour affronter son poursuivant", "meaning": "Représente le courage, affronter ses peurs, et la préparation à aborder ce que vous avez évité." }
        ]
      },
      "es": {
        "fullInterpretation": "<p>Ser perseguido en un sueño es uno de los temas de sueño más comunes y provocadores de ansiedad experimentados en todo el mundo. Estos sueños a menudo se sienten intensamente reales, completos con corazón acelerado, sudoración, y ese sentimiento desesperado de correr pero no poder escapar.</p>\n<p>En esencia, los sueños de persecución típicamente representan evitación. Lo que te persigue en el sueño a menudo simboliza algo de lo que estás huyendo en tu vida despierta—un problema que no quieres enfrentar, una emoción que estás suprimiendo, una responsabilidad que estás evitando, o un miedo que no has confrontado.</p>\n<p>La identidad del perseguidor importa mucho. Ser perseguido por una figura desconocida podría representar miedos vagos y sin nombre. Ser perseguido por un animal podría conectar con miedos primarios o instintos. Ser perseguido por alguien que conoces podría reflejar problemas en esa relación.</p>\n<p>Presta atención a cómo termina la persecución. Escapar exitosamente podría indicar que tienes los recursos para manejar tus desafíos. Ser atrapado podría sugerir que es hora de dejar de correr y enfrentar lo que has estado evitando.</p>",
        "variations": [
          { "context": "Ser perseguido por una figura desconocida", "meaning": "A menudo representa miedos vagos, ansiedad sin nombre, o aspectos de ti mismo que no has reconocido completamente." },
          { "context": "Ser perseguido por un animal", "meaning": "Puede simbolizar miedos primarios, instintos, o fuerzas naturales en tu vida que se sienten amenazantes." },
          { "context": "Ser perseguido por alguien que conoces", "meaning": "Podría reflejar problemas con esa persona o cualidades que representa que estás evitando en ti mismo." },
          { "context": "Correr pero no poder moverse", "meaning": "Sugiere sentirse impotente, atascado, o incapaz de escapar de una situación a pesar de tus esfuerzos." },
          { "context": "Girarte para enfrentar a tu perseguidor", "meaning": "Representa coraje, confrontar miedos, y estar listo para abordar lo que has estado evitando." }
        ]
      }
    }
  }
}
