{
  "wolf": {
    "en": {
      "fullInterpretation": "<p>Wolves are powerful archetypal symbols that appear in human mythology and dreams across cultures. These magnificent creatures embody the wild, untamed aspects of nature and our own psyche. When a wolf appears in your dreams, it often speaks to primal instincts, social dynamics, and the balance between civilization and wildness within yourself.</p>\n<p>The wolf can represent conflicting symbolic meanings depending on the dream context. On one hand, wolves symbolize fierce independence, keen instincts, and survival intelligence. They remind us of our animal nature—the intuitive, instinctual part of ourselves that knows things without rational explanation. If you're suppressing your instincts or intuition in waking life, a wolf may appear to remind you to trust your gut feelings.</p>\n<p>Simultaneously, wolves are deeply social creatures with complex pack hierarchies and strong family bonds. Dreaming of wolves can relate to your relationship with community, family, or social groups. Are you a lone wolf by choice or isolation? Do you feel you belong to your \"pack,\" or are you struggling to find your place? The wolf can illuminate questions about loyalty, belonging, and social identity.</p>\n<p>The wolf's behavior in your dream matters significantly. A threatening or aggressive wolf might represent perceived danger, someone you don't trust, or your own suppressed anger and aggression. A friendly or protective wolf could symbolize a guardian figure, loyal ally, or your own inner strength coming to your aid. A howling wolf might represent a call to authenticity or expression of loneliness.</p>",
      "variations": [
        {
          "context": "Wolf attacking",
          "meaning": "May represent feeling threatened, facing aggression from others, or confronting suppressed anger and instinctual energy within yourself."
        },
        {
          "context": "Lone wolf",
          "meaning": "Often symbolizes independence, isolation, or choosing to walk your own path separate from the pack or social expectations."
        },
        {
          "context": "Wolf pack",
          "meaning": "Represents community, family dynamics, social hierarchies, or questions about your role and belonging within groups."
        },
        {
          "context": "Friendly or protective wolf",
          "meaning": "May symbolize a loyal ally, guardian figure, or your own inner strength and instincts protecting and guiding you."
        },
        {
          "context": "Werewolf transformation",
          "meaning": "Could indicate fear of losing control, the struggle between civilized and wild aspects of self, or transformative change."
        },
        {
          "context": "Wolf howling",
          "meaning": "Suggests need for self-expression, calling out to your tribe, or acknowledging feelings of loneliness and longing."
        },
        {
          "context": "Being chased by a wolf",
          "meaning": "Often represents running from your instincts, avoiding wildness or authentic self, or fleeing from something that feels threatening."
        }
      ]
    },
    "fr": {
      "fullInterpretation": "<p>Les loups sont de puissants symboles archétypaux qui apparaissent dans la mythologie humaine et les rêves à travers les cultures. Ces créatures magnifiques incarnent les aspects sauvages et indomptés de la nature et de notre propre psyché. Quand un loup apparaît dans vos rêves, il parle souvent d'instincts primordiaux, de dynamiques sociales et de l'équilibre entre civilisation et sauvagerie en vous-même.</p>\n<p>Le loup peut représenter des significations symboliques contradictoires selon le contexte du rêve. D'une part, les loups symbolisent l'indépendance farouche, les instincts aiguisés et l'intelligence de survie. Ils nous rappellent notre nature animale—la partie intuitive et instinctive de nous-mêmes qui sait des choses sans explication rationnelle. Si vous réprimez vos instincts ou votre intuition dans la vie éveillée, un loup peut apparaître pour vous rappeler de faire confiance à vos pressentiments.</p>\n<p>Simultanément, les loups sont des créatures profondément sociales avec des hiérarchies de meute complexes et de forts liens familiaux. Rêver de loups peut se rapporter à votre relation avec la communauté, la famille ou les groupes sociaux. Êtes-vous un loup solitaire par choix ou par isolement ? Sentez-vous que vous appartenez à votre \"meute,\" ou luttez-vous pour trouver votre place ?</p>\n<p>Le comportement du loup dans votre rêve importe significativement. Un loup menaçant ou agressif pourrait représenter un danger perçu, quelqu'un en qui vous n'avez pas confiance, ou votre propre colère et agressivité réprimées. Un loup amical ou protecteur pourrait symboliser une figure gardienne, un allié loyal, ou votre propre force intérieure venant à votre aide.</p>",
      "variations": [
        {
          "context": "Loup qui attaque",
          "meaning": "Peut représenter se sentir menacé, faire face à l'agression d'autres ou confronter la colère et l'énergie instinctive réprimées en vous-même."
        },
        {
          "context": "Loup solitaire",
          "meaning": "Symbolise souvent l'indépendance, l'isolement ou le choix de suivre votre propre chemin séparé de la meute ou des attentes sociales."
        },
        {
          "context": "Meute de loups",
          "meaning": "Représente la communauté, les dynamiques familiales, les hiérarchies sociales ou les questions sur votre rôle et appartenance dans les groupes."
        },
        {
          "context": "Loup amical ou protecteur",
          "meaning": "Peut symboliser un allié loyal, une figure gardienne, ou votre propre force intérieure et instincts vous protégeant et guidant."
        },
        {
          "context": "Transformation en loup-garou",
          "meaning": "Pourrait indiquer la peur de perdre le contrôle, la lutte entre aspects civilisés et sauvages du soi, ou changement transformatif."
        },
        {
          "context": "Loup qui hurle",
          "meaning": "Suggère besoin d'expression de soi, appel à votre tribu, ou reconnaissance de sentiments de solitude et désir."
        },
        {
          "context": "Être poursuivi par un loup",
          "meaning": "Représente souvent fuir vos instincts, éviter la sauvagerie ou le soi authentique, ou fuir quelque chose qui semble menaçant."
        }
      ]
    },
    "es": {
      "fullInterpretation": "<p>Los lobos son poderosos símbolos arquetípicos que aparecen en la mitología humana y los sueños a través de las culturas. Estas magníficas criaturas encarnan los aspectos salvajes e indomables de la naturaleza y nuestra propia psique. Cuando un lobo aparece en tus sueños, a menudo habla de instintos primordiales, dinámicas sociales y el equilibrio entre civilización y salvajismo dentro de ti mismo.</p>\n<p>El lobo puede representar significados simbólicos conflictivos dependiendo del contexto del sueño. Por un lado, los lobos simbolizan independencia feroz, instintos agudos e inteligencia de supervivencia. Nos recuerdan nuestra naturaleza animal—la parte intuitiva e instintiva de nosotros mismos que sabe cosas sin explicación racional. Si estás suprimiendo tus instintos o intuición en la vida despierta, un lobo puede aparecer para recordarte confiar en tus corazonadas.</p>\n<p>Simultáneamente, los lobos son criaturas profundamente sociales con jerarquías de manada complejas y fuertes lazos familiares. Soñar con lobos puede relacionarse con tu relación con la comunidad, familia o grupos sociales. ¿Eres un lobo solitario por elección o aislamiento? ¿Sientes que perteneces a tu \"manada,\" o estás luchando por encontrar tu lugar?</p>\n<p>El comportamiento del lobo en tu sueño importa significativamente. Un lobo amenazante o agresivo podría representar peligro percibido, alguien en quien no confías, o tu propia ira y agresión suprimidas. Un lobo amigable o protector podría simbolizar una figura guardiana, aliado leal, o tu propia fuerza interior viniendo en tu ayuda.</p>",
      "variations": [
        {
          "context": "Lobo atacando",
          "meaning": "Puede representar sentirse amenazado, enfrentar agresión de otros, o confrontar ira y energía instintiva suprimida dentro de ti mismo."
        },
        {
          "context": "Lobo solitario",
          "meaning": "A menudo simboliza independencia, aislamiento, o elegir caminar tu propio camino separado de la manada o expectativas sociales."
        },
        {
          "context": "Manada de lobos",
          "meaning": "Representa comunidad, dinámicas familiares, jerarquías sociales, o preguntas sobre tu rol y pertenencia dentro de grupos."
        },
        {
          "context": "Lobo amigable o protector",
          "meaning": "Puede simbolizar un aliado leal, figura guardiana, o tu propia fuerza interior e instintos protegiéndote y guiándote."
        },
        {
          "context": "Transformación en hombre lobo",
          "meaning": "Podría indicar miedo a perder control, lucha entre aspectos civilizados y salvajes del yo, o cambio transformativo."
        },
        {
          "context": "Lobo aullando",
          "meaning": "Sugiere necesidad de autoexpresión, llamado a tu tribu, o reconocimiento de sentimientos de soledad y anhelo."
        },
        {
          "context": "Ser perseguido por un lobo",
          "meaning": "A menudo representa huir de tus instintos, evitar salvajismo o yo auténtico, o huir de algo que se siente amenazante."
        }
      ]
    }
  }
}
